prism5426/EE475_Group7/STM32/ultrasonic_sensor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Trigger0_Pin GPIO_PIN_0
#define Trigger0_GPIO_Port GPIOC
#define Echo0_Pin GPIO_PIN_1
#define Echo0_GPIO_Port GPIOC
#define Trigger1_Pin GPIO_PIN_2
#define Trigger1_GPIO_Port GPIOC
#define Echo1_Pin GPIO_PIN_3
#define Echo1_GPIO_Port GPIOC
#define Trigger2_Pin GPIO_PIN_4
#define Trigger2_GPIO_Port GPIOC
#define Echo2_Pin GPIO_PIN_5
#define Echo2_GPIO_Port GPIOC
#define Trigger3_Pin GPIO_PIN_6
#define Trigger3_GPIO_Port GPIOC
#define Echo3_Pin GPIO_PIN_7
#define Echo3_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */
#define Trigger0_Pin GPIO_PIN_0
#define Trigger0_GPIO_Port GPIOC
#define Echo0_Pin GPIO_PIN_1
#define Echo0_GPIO_Port GPIOC
#define Trigger1_Pin GPIO_PIN_2
#define Trigger1_GPIO_Port GPIOC
#define Echo1_Pin GPIO_PIN_3
#define Echo1_GPIO_Port GPIOC
#define Trigger2_Pin GPIO_PIN_4
#define Trigger2_GPIO_Port GPIOC
#define Echo2_Pin GPIO_PIN_5
#define Echo2_GPIO_Port GPIOC
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
